lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
/* Local debug logs: hữu ích khi Raspberry Pi Gateway/MQTT chưa bật */
#define SENSOR_LOG_EVERY_N        1    /* 1 = log mỗi gói sensor, tương ứng ~5s */
#define LIGHT_LOG_HEARTBEAT_S     30   /* log trạng thái đèn mỗi 30s nếu không đổi */
#define OFFLINE_LOG_EVERY_N       5    /* khi MQTT mất, log buffer mỗi 5 packet */
#define DRAIN_MAX_PER_CYCLE       5    /* số packet offline đẩy lại mỗi chu kỳ publish */

/* Digital Twin direct safety timeout */
#define DT_PUMP_DEFAULT_DURATION_S   10
#define DT_PUMP_MAX_DURATION_S       15
#define DT_LIGHT_DEFAULT_DURATION_S  300
#define DT_LIGHT_MAX_DURATION_S      1800
#define ACTUATOR_STATE_PUBLISH_MS    5000

/* Phase & Light Schedule */
#define PHASE_1_DARK         1
#define PHASE_2_LIGHT        2
#define DEFAULT_PHASE        PHASE_1_DARK

/* Phase start policy
 * - Phase 0 ngâm hạt nằm ngoài firmware.
 * - planting_start_epoch = thời điểm đã gieo hạt vào đất.
 * - DB/Unity/Web Start là nguồn chuẩn; ESP32 NVS chỉ là cache local để chạy offline.
 * - Reset/mất điện/flash thường: NVS còn, không reset mốc.
 * - Nếu NVS chưa có mốc: KHÔNG tự BOOT_INIT bằng RTC hiện tại; publish valid=false và chờ Gateway SET_EPOCH.
 * - Bắt đầu lứa mới: gửi MQTT TOPIC_CMD_PLANTING_START action=SET_NOW/SET_EPOCH/CLEAR.
 */
#define DARK_PHASE_DAYS     2.0f
#define NVS_NS_PLANTING     "planting"
#define NVS_KEY_START_EPOCH "start_epoch"
#define NVS_KEY_LAST_CMD_ID "last_cmd"
#define PLANTING_CMD_ID_MAX 64
#define DIRECT_CMD_ID_MAX   64

/* Task core pinning */
#define CORE_NET            0
#define CORE_APP            1

#define LIGHT_ON_HOUR_UTC7   8
#define LIGHT_OFF_HOUR_UTC7  16

/* ADS1115 Calibration */
#define SOIL_V_DRY           3.0f
#define SOIL_V_WET           1.1f


/* Sensor filter + soil fusion v2.9.2
 * Sampling target: 1 second.
 * Pipeline: ADS raw -> median samples -> voltage->% -> EMA with recovery -> Schmid-Schossmaier interval fusion.
 * v2.9.2 adds:
 * - Large-change confirm so EMA does not get stuck when sensor is plugged/unplugged.
 * - Soil presence state for OPEN_AIR_OR_DRY / ACTIVE / REMOVED_OR_EXTREME_DRY / SHORT_GND.
 * - Auto pump ON guard when soil is not reliable for plant-control.
 */
#define FILTER_TEMP_ALPHA             0.08f
#define FILTER_HUM_ALPHA              0.08f
#define FILTER_LUX_ALPHA              0.25f
#define FILTER_SOIL_ALPHA             0.10f

#define TEMP_MAX_JUMP_C               3.0f
#define HUM_MAX_JUMP_PERCENT          10.0f
#define LUX_MAX_JUMP_PERCENT          80.0f
#define SOIL_MAX_JUMP_PERCENT         25.0f
#define SOIL_JUMP_CONFIRM_COUNT       3     /* 3 mẫu liên tiếp mới chấp nhận thay đổi lớn */
#define SOIL_RECOVERY_ALPHA           0.40f /* alpha cao khi xác nhận cắm/tháo thật */

#define SOIL_MEDIAN_SAMPLES           5
#define SOIL_SAMPLE_DELAY_MS          12
#define SOIL_FUSION_ERROR_PERCENT     5.0f
#define SOIL_FUSION_FAULT_TOLERANCE   1
#define SOIL_MIN_VALID_COUNT          3
#define SOIL_ZERO_STUCK_LIMIT         30    /* 30s liên tục 0%: cảnh báo stuck/khô cực hạn */
#define SOIL_VOLTAGE_MIN_VALID       -0.05f
#define SOIL_VOLTAGE_MAX_VALID        4.10f
#define SOIL_RAIL_HIGH_V               3.25f  /* Gần 3V3: đất rất khô / chưa cắm đất / open-air */
#define SOIL_RAIL_LOW_V                0.05f  /* Gần 0V: có thể chập GND / lỗi dây */
#define SOIL_REMOVED_CONFIRM_COUNT     5      /* 5s rail-high sau khi từng ACTIVE -> nghi tháo ra */

/* ================================================================
   BIẾN TOÀN CỤC & TẠO CẤU TRÚC DỮ LIỆU
   ================================================================ */

static const char *TAG = "SPROUT";

/* WiFi & MQTT States */
static EventGroupHandle_t s_wifi_eg;
#define WIFI_CONNECTED_BIT  BIT0
#define WIFI_FAIL_BIT       BIT1

static esp_mqtt_client_handle_t s_mqtt = NULL;
static bool s_mqtt_connected = false;

/* Biến phục vụ chức năng Multi-WiFi */
static int s_current_wifi_index = 0;
static int s_wifi_retry_count   = 0;

/* Các biến logic */
static int  s_step           = 0;
static int  s_current_phase  = DEFAULT_PHASE;   /* phase ESP32 tự tính từ RTC; dùng làm fallback nếu RTC lỗi */
static int64_t s_pump_direct_until_us  = 0;     /* Digital Twin direct pump hold-off */
static int64_t s_light_direct_until_us = 0;     /* Digital Twin direct light hold-off */
static SemaphoreHandle_t s_sensor_mutex;
static SemaphoreHandle_t s_i2c_mutex;
static i2c_dev_t         s_ads_dev = {0};
static i2c_dev_t         s_rtc_dev = {0};
static bool              s_sntp_started = false;
static time_t            s_planting_start_epoch = 0;
static bool              s_planting_start_valid = false;
static char              s_last_planting_cmd_id[PLANTING_CMD_ID_MAX] = {0};

/* v2.9.4: lưu command_id/seq gần nhất của Pump/Light direct để publish actuator_state ACK chính xác.
 * Backend v1.3.0 sẽ ưu tiên ACK theo last_pump_command_id/last_light_command_id.
 */
static char              s_last_pump_cmd_id[DIRECT_CMD_ID_MAX] = {0};
static int               s_last_pump_cmd_seq = 0;
static char              s_last_light_cmd_id[DIRECT_CMD_ID_MAX] = {0};
static int               s_last_light_cmd_seq = 0;

/**
 * @brief Cấu trúc bản ghi chứa toàn bộ dữ liệu Snapshot từ cảm biến
 */
typedef struct {
    float temperature;
    float air_humidity;
    float soil_pct[SOIL_CH_COUNT];          /* Soil sau median + EMA từng kênh */
    float soil_voltage[SOIL_CH_COUNT];      /* Điện áp ADS1115 sau median, để debug calibration */
    float soil_avg_raw;                     /* Trung bình cộng 4 điểm sau lọc */
    float soil_min;
    float soil_max;
    float soil_fused;                       /* Giá trị đại diện bằng Schmid-Schossmaier FTI */
    float soil_fusion_lo;
    float soil_fusion_hi;
    float soil_fusion_confidence;           /* 0.0 .. 1.0 */
    uint8_t  soil_valid_count;
    uint16_t soil_zero_streak;
    bool  soil_reliable;
    bool  soil_stuck_zero;
    bool  soil_saturated_dry;    /* Vraw sát 3V3: đất rất khô/chưa cắm đất, không tự coi là lỗi */
    bool  soil_sensor_fault;     /* Vraw bất thường hoặc stuck không phải rail-high */
    bool  soil_control_reliable; /* TRUE khi dữ liệu soil đủ tin cậy để Gateway AI điều khiển bơm */
    char  soil_presence_state[32]; /* ACTIVE / OPEN_AIR_OR_DRY / REMOVED_OR_EXTREME_DRY / SHORT_GND */
    char  soil_fusion_method[48];
    float lux;
    bool  pump_state;
    bool  light_state;
    int   phase;
    float days_after_planting;
    char  phase_source[24];    /* ESP32_RTC / RTC_ERROR */
    char  pump_mode[24];       /* AI_AUTO / DIRECT_DT */
    char  pump_reason[32];     /* GATEWAY_AI_AUTO / DT_DIRECT / DIRECT_TIMEOUT_OFF */
    char  light_mode[24];      /* AUTO_RTC / DIRECT_DT / LEGACY_CMD */
    char  light_reason[32];    /* PHASE1_LOW_LIGHT / PHASE2_DAYLIGHT_SIM / DT_DIRECT */
    bool  dht11_ok;
    bool  bh1750_ok;
    bool  ads1115_ok;
    bool  rtc_ok;
    char  iso_time[32];     /* ISO8601 từ DS3231 */
    int   wifi_rssi;
    long  uptime_s;
} sensor_data_t;

static sensor_data_t g_sensor = {0};

/* ================================================================
   RING BUFFER - Tránh mất dữ liệu (Offline Storage)
   ================================================================ */

#define RING_BUF_SIZE        64     /* Số packet tối đa lưu khi offline */
#define JSON_MAX_LEN         1536

