lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
typedef struct {
    char  json[JSON_MAX_LEN];
    bool  valid;
} ring_entry_t;

typedef struct {
    ring_entry_t buf[RING_BUF_SIZE];
    int          head;    
    int          tail;    
    int          count;   
    SemaphoreHandle_t mutex;
} ring_buf_t;

static ring_buf_t s_ring = {0};

/**
 * @brief Khởi tạo Ring Buffer để lưu trữ JSON Payload khi mất mạng
 */
static void ring_init(void) {
    s_ring.head  = 0;
    s_ring.tail  = 0;
    s_ring.count = 0;
    s_ring.mutex = xSemaphoreCreateMutex();
}

/**
 * @brief Đẩy một MQTT payload vào bộ đệm
 * @param json Chuỗi JSON cần lưu
 * @return true nếu thành công, false nếu bộ đệm bận (mutex lock failed)
 */
static bool ring_push(const char *json) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return false;

    if (s_ring.count == RING_BUF_SIZE) {
        s_ring.tail = (s_ring.tail + 1) % RING_BUF_SIZE;
        s_ring.count--;
        ESP_LOGW("RING", "Buffer đầy — ghi đè packet cũ nhất. Gateway/MQTT broker có thể chưa bật");
    }

    strlcpy(s_ring.buf[s_ring.head].json, json, JSON_MAX_LEN);
    s_ring.buf[s_ring.head].valid = true;
    s_ring.head  = (s_ring.head + 1) % RING_BUF_SIZE;
    s_ring.count++;

    int count_after_push = s_ring.count;
    xSemaphoreGive(s_ring.mutex);

    if ((count_after_push % OFFLINE_LOG_EVERY_N) == 0 || count_after_push == 1 || count_after_push == RING_BUF_SIZE) {
        ESP_LOGW("RING", "Đang lưu offline: %d/%d packet", count_after_push, RING_BUF_SIZE);
    }
    return true;
}

static bool ring_peek(char *out_json) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return false;
    bool has = (s_ring.count > 0);
    if (has) strlcpy(out_json, s_ring.buf[s_ring.tail].json, JSON_MAX_LEN);
    xSemaphoreGive(s_ring.mutex);
    return has;
}

static void ring_pop(void) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return;
    if (s_ring.count > 0) {
        s_ring.buf[s_ring.tail].valid = false;
        s_ring.tail  = (s_ring.tail + 1) % RING_BUF_SIZE;
        s_ring.count--;
    }
    xSemaphoreGive(s_ring.mutex);
}

static int ring_count(void) {
    if (!xSemaphoreTake(s_ring.mutex, pdMS_TO_TICKS(50))) return 0;
    int c = s_ring.count;
    xSemaphoreGive(s_ring.mutex);
    return c;
}

/* ================================================================
   BỘ LỌC MOVING AVERAGE DHT11
   ================================================================ */

#define DHT_FILTER_SIZE 5

typedef struct {
    float temp_buf[DHT_FILTER_SIZE];
    float hum_buf[DHT_FILTER_SIZE];
    uint8_t index;
    uint8_t count;
} dht_filter_t;

static dht_filter_t s_dht_ma = {0};

static void dht11_moving_avg(float t, float h, float *out_t, float *out_h) {
    s_dht_ma.temp_buf[s_dht_ma.index] = t;
    s_dht_ma.hum_buf[s_dht_ma.index]  = h;
    s_dht_ma.index = (s_dht_ma.index + 1) % DHT_FILTER_SIZE;
    if (s_dht_ma.count < DHT_FILTER_SIZE) s_dht_ma.count++;

    float st = 0, sh = 0;
    for (int i = 0; i < s_dht_ma.count; i++) {
        st += s_dht_ma.temp_buf[i];
        sh += s_dht_ma.hum_buf[i];
    }
    *out_t = st / s_dht_ma.count;
    *out_h = sh / s_dht_ma.count;
}

/* ================================================================
   HELPER - RTC & CẢM BIẾN
   ================================================================ */

static bool i2c_take(uint32_t timeout_ms) {
    if (!s_i2c_mutex) return true;
    return xSemaphoreTake(s_i2c_mutex, pdMS_TO_TICKS(timeout_ms)) == pdTRUE;
}

static void i2c_give(void) {
    if (s_i2c_mutex) xSemaphoreGive(s_i2c_mutex);
}

static bool rtc_get_time_safe(struct tm *out) {
    if (!out) return false;
    bool ok = false;
    if (i2c_take(2500)) {
        ok = (ds3231_get_time(&s_rtc_dev, out) == ESP_OK);
        i2c_give();
    }
    return ok;
}

static bool rtc_set_time_safe(const struct tm *in) {
    if (!in) return false;
    struct tm tmp = *in;
    bool ok = false;
    if (i2c_take(2500)) {
        ok = (ds3231_set_time(&s_rtc_dev, &tmp) == ESP_OK);
        i2c_give();
    }
    return ok;
}

static time_t tm_local_to_epoch(struct tm t) {
    t.tm_isdst = -1;
    return mktime(&t);
}

static bool rtc_get_epoch_from_ds3231(time_t *epoch_out) {
    struct tm t = {0};
    if (!rtc_get_time_safe(&t) || t.tm_year <= 100) return false;
    time_t e = tm_local_to_epoch(t);
    if (e <= 0) return false;
    if (epoch_out) *epoch_out = e;
    return true;
}

static void epoch_to_local_tm(time_t epoch, struct tm *out) {
    localtime_r(&epoch, out);
}

static void epoch_to_iso_utc7(time_t epoch, char *buf, size_t len) {
    if (!buf || len == 0) return;
    if (epoch <= 0) {
        strlcpy(buf, "INVALID", len);
        return;
    }
    struct tm t = {0};
    epoch_to_local_tm(epoch, &t);
    strftime(buf, len, "%Y-%m-%dT%H:%M:%S+07:00", &t);
}

static bool planting_start_load_from_nvs(void) {
    nvs_handle_t h;
    int64_t epoch = 0;
    esp_err_t err = nvs_open(NVS_NS_PLANTING, NVS_READONLY, &h);
    if (err != ESP_OK) return false;

    err = nvs_get_i64(h, NVS_KEY_START_EPOCH, &epoch);

    size_t cmd_len = sizeof(s_last_planting_cmd_id);
    if (nvs_get_str(h, NVS_KEY_LAST_CMD_ID, s_last_planting_cmd_id, &cmd_len) != ESP_OK) {
        s_last_planting_cmd_id[0] = '\0';
    }

    nvs_close(h);

    if (err == ESP_OK && epoch > 0) {
        s_planting_start_epoch = (time_t)epoch;
        s_planting_start_valid = true;
        char iso[32];
        epoch_to_iso_utc7(s_planting_start_epoch, iso, sizeof(iso));
        ESP_LOGI(TAG, "PLANTING: load NVS start_epoch=%lld (%s), last_cmd=%s",
                 (long long)s_planting_start_epoch, iso,
                 s_last_planting_cmd_id[0] ? s_last_planting_cmd_id : "NONE");
        return true;
    }

    return false;
}

static bool planting_start_save_to_nvs(time_t epoch, const char *cmd_id) {
    if (epoch <= 0) return false;

    nvs_handle_t h;
    esp_err_t err = nvs_open(NVS_NS_PLANTING, NVS_READWRITE, &h);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "PLANTING: nvs_open write lỗi: %s", esp_err_to_name(err));
        return false;
    }

    err = nvs_set_i64(h, NVS_KEY_START_EPOCH, (int64_t)epoch);
    if (err == ESP_OK && cmd_id && cmd_id[0]) {
        err = nvs_set_str(h, NVS_KEY_LAST_CMD_ID, cmd_id);
    }
    if (err == ESP_OK) err = nvs_commit(h);
    nvs_close(h);

    if (err == ESP_OK) {
        s_planting_start_epoch = epoch;
        s_planting_start_valid = true;
        if (cmd_id && cmd_id[0]) strlcpy(s_last_planting_cmd_id, cmd_id, sizeof(s_last_planting_cmd_id));
        char iso[32];
        epoch_to_iso_utc7(epoch, iso, sizeof(iso));
        ESP_LOGW(TAG, "PLANTING: save NVS start_epoch=%lld (%s), cmd_id=%s",
                 (long long)epoch, iso, cmd_id && cmd_id[0] ? cmd_id : "BOOT_INIT");
        return true;
    }

    ESP_LOGE(TAG, "PLANTING: save NVS lỗi: %s", esp_err_to_name(err));
    return false;
}

static bool planting_start_clear_nvs(void) {
    nvs_handle_t h;
    esp_err_t err = nvs_open(NVS_NS_PLANTING, NVS_READWRITE, &h);
    if (err != ESP_OK) return false;

    nvs_erase_key(h, NVS_KEY_START_EPOCH);
    nvs_erase_key(h, NVS_KEY_LAST_CMD_ID);
    err = nvs_commit(h);
    nvs_close(h);

