lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    s_planting_start_epoch = 0;
    s_planting_start_valid = false;
    s_last_planting_cmd_id[0] = '\0';

    return err == ESP_OK;
}

static void rtc_sync_compile_time(void) {
    struct tm t = {0};
    if (!rtc_get_time_safe(&t)) return;

    if (t.tm_year <= 100) {   
        struct tm ct = {0};
        strptime(__DATE__ " " __TIME__, "%b %d %Y %H:%M:%S", &ct);
        if (rtc_set_time_safe(&ct)) {
            ESP_LOGW("RTC", "Đồng bộ RTC từ compile time: %s %s", __DATE__, __TIME__);
        }
    }
}

/**
 * @brief Kiểm tra system time đã hợp lệ sau NTP chưa.
 */
static bool system_time_is_valid(void) {
    time_t now = 0;
    struct tm timeinfo = {0};
    time(&now);
    localtime_r(&now, &timeinfo);
    return (timeinfo.tm_year >= (2024 - 1900));
}

/**
 * @brief Khởi động SNTP một lần. Không gọi lại nhiều lần để tránh lỗi state.
 */
static void ntp_start_once(void) {
    if (s_sntp_started) return;

    setenv("TZ", TZ_INFO_UTC7, 1);
    tzset();

    ESP_LOGI("NTP", "SNTP init: server1=%s server2=%s timezone=%s", NTP_SERVER_1, NTP_SERVER_2, TZ_INFO_UTC7);
    esp_sntp_setoperatingmode(ESP_SNTP_OPMODE_POLL);
    esp_sntp_setservername(0, NTP_SERVER_1);
    esp_sntp_setservername(1, NTP_SERVER_2);
    esp_sntp_init();

    s_sntp_started = true;
}

/**
 * @brief Chờ NTP cập nhật system time.
 */
static bool ntp_wait_time_valid(uint32_t timeout_ms) {
    int waited_ms = 0;
    while (waited_ms < (int)timeout_ms) {
        if (system_time_is_valid()) {
            time_t now = 0;
            struct tm local = {0};
            time(&now);
            localtime_r(&now, &local);
            ESP_LOGI("NTP", "System time valid: %04d-%02d-%02d %02d:%02d:%02d UTC+7",
                     local.tm_year + 1900, local.tm_mon + 1, local.tm_mday,
                     local.tm_hour, local.tm_min, local.tm_sec);
            return true;
        }
        vTaskDelay(pdMS_TO_TICKS(500));
        waited_ms += 500;
    }
    ESP_LOGW("NTP", "Timeout chờ NTP sau %ums", timeout_ms);
    return false;
}

/**
 * @brief Đồng bộ DS3231 từ system time đã được NTP cập nhật.
 * @return true nếu RTC đang đúng hoặc đã set thành công.
 */
static bool rtc_sync_from_ntp_if_needed(void) {
    if (!system_time_is_valid()) {
        ESP_LOGW("RTC", "Không sync DS3231: system time chưa hợp lệ");
        return false;
    }

    time_t now = 0;
    struct tm sys_local = {0};
    time(&now);
    localtime_r(&now, &sys_local);  /* UTC+7 do TZ_INFO_UTC7 */

    struct tm rtc_time = {0};
    bool rtc_read_ok = rtc_get_time_safe(&rtc_time);
    if (!rtc_read_ok || rtc_time.tm_year <= 100) {
        if (rtc_set_time_safe(&sys_local)) {
            ESP_LOGW("RTC", "DS3231 invalid/lỗi đọc -> set từ NTP: %04d-%02d-%02d %02d:%02d:%02d UTC+7",
                     sys_local.tm_year + 1900, sys_local.tm_mon + 1, sys_local.tm_mday,
                     sys_local.tm_hour, sys_local.tm_min, sys_local.tm_sec);
            return true;
        }
        ESP_LOGE("RTC", "Set DS3231 từ NTP thất bại");
        return false;
    }

    time_t rtc_epoch = mktime(&rtc_time);
    time_t sys_epoch = mktime(&sys_local);
    double drift_s = difftime(sys_epoch, rtc_epoch);
    if (drift_s < 0) drift_s = -drift_s;

    if (drift_s > RTC_NTP_MAX_DRIFT_S) {
        if (rtc_set_time_safe(&sys_local)) {
            ESP_LOGW("RTC", "DS3231 lệch %.0fs > %ds -> đã sync từ NTP", drift_s, RTC_NTP_MAX_DRIFT_S);
            return true;
        }
        ESP_LOGE("RTC", "DS3231 lệch %.0fs nhưng set_time thất bại", drift_s);
        return false;
    }

    ESP_LOGI("RTC", "DS3231 OK, lệch %.0fs <= %ds, không cần ghi lại", drift_s, RTC_NTP_MAX_DRIFT_S);
    return true;
}

/**
 * @brief Task định kỳ đồng bộ NTP -> DS3231.
 * - Chạy sau khi WiFi có IP.
 * - Lần đầu sync ngay sau boot nếu có mạng.
 * - Sau đó sync lại mỗi 24h để DS3231 không trôi giờ.
 */
static void ntp_rtc_sync_task(void *pv) {
    (void)pv;
    ESP_LOGI("NTP", "ntp_rtc_sync_task running on core %d", xPortGetCoreID());

    while (1) {
        EventBits_t bits = xEventGroupWaitBits(
            s_wifi_eg,
            WIFI_CONNECTED_BIT,
            pdFALSE,
            pdFALSE,
            pdMS_TO_TICKS(RTC_NTP_RETRY_MS)
        );

        if (!(bits & WIFI_CONNECTED_BIT)) {
            ESP_LOGW("NTP", "Chưa có WiFi, hoãn sync NTP -> DS3231");
            continue;
        }

        ntp_start_once();

        bool ok = false;
        if (ntp_wait_time_valid(NTP_SYNC_TIMEOUT_MS)) {
            ok = rtc_sync_from_ntp_if_needed();
        }

        if (ok) {
            vTaskDelay(pdMS_TO_TICKS(RTC_NTP_SYNC_PERIOD_MS));
        } else {
            ESP_LOGW("NTP", "Sync NTP -> DS3231 thất bại, thử lại sau %d phút", RTC_NTP_RETRY_MS / 60000);
            vTaskDelay(pdMS_TO_TICKS(RTC_NTP_RETRY_MS));
        }
    }
}

static void rtc_get_iso(char *buf, size_t len) {
    struct tm t = {0};
    if (rtc_get_time_safe(&t) && t.tm_year > 100) {
        strftime(buf, len, "%Y-%m-%dT%H:%M:%S+07:00", &t);
    } else {
        long up = (long)(esp_timer_get_time() / 1000000);
        snprintf(buf, len, "uptime:%lds", up);
    }
}

static float ads_voltage_to_pct(double v) {
    if (v >= SOIL_V_DRY) return 0.0f;
    if (v <= SOIL_V_WET) return 100.0f;
    return (SOIL_V_DRY - (float)v) / (SOIL_V_DRY - SOIL_V_WET) * 100.0f;
}


/* ================================================================
   SENSOR FILTER + SCHMID-SCHOSSMAIER SOIL FUSION v2.9.2
   ================================================================ */

typedef struct {
    bool initialized;
    float temperature;
    float air_humidity;
    float lux;
    float soil_pct[SOIL_CH_COUNT];
    float soil_voltage[SOIL_CH_COUNT];
    uint8_t soil_jump_count[SOIL_CH_COUNT];
    bool soil_seen_active[SOIL_CH_COUNT];
    uint16_t soil_rail_high_streak[SOIL_CH_COUNT];
    uint16_t soil_rail_low_streak[SOIL_CH_COUNT];
    uint16_t soil_zero_streak;
    char soil_presence_state[32];
} sensor_filter_state_t;

static sensor_filter_state_t s_filter = {0};

static float clampf_local(float x, float lo, float hi) {
    if (x < lo) return lo;
    if (x > hi) return hi;
    return x;
}

static float absf_local(float x) {
    return (x < 0.0f) ? -x : x;
}

static float ema_update(float prev, float cur, float alpha) {
    return alpha * cur + (1.0f - alpha) * prev;
}

static float soil_ema_update_with_recovery(int ch, float previous, float current) {
    float diff = absf_local(current - previous);

    if (diff <= SOIL_MAX_JUMP_PERCENT) {
        s_filter.soil_jump_count[ch] = 0;
        return ema_update(previous, current, FILTER_SOIL_ALPHA);
    }

    /* Nhảy lớn 1-2 mẫu có thể là nhiễu. Nếu kéo dài >= SOIL_JUMP_CONFIRM_COUNT
     * thì xem là thay đổi thật, ví dụ cắm cảm biến vào đất hoặc tháo cảm biến ra.
     */
    if (s_filter.soil_jump_count[ch] < 255) {
        s_filter.soil_jump_count[ch]++;
    }

    if (s_filter.soil_jump_count[ch] >= SOIL_JUMP_CONFIRM_COUNT) {
        s_filter.soil_jump_count[ch] = 0;
        return ema_update(previous, current, SOIL_RECOVERY_ALPHA);
    }

    return previous;
}

static void sort_float_array(float *a, int n) {
    for (int i = 0; i < n - 1; i++) {
        for (int j = i + 1; j < n; j++) {
            if (a[j] < a[i]) {
                float t = a[i];
                a[i] = a[j];
                a[j] = t;
            }
        }
    }
}

static float median_float_array(float *a, int n) {
    sort_float_array(a, n);
    if (n <= 0) return 0.0f;
    if ((n % 2) == 1) return a[n / 2];
    return 0.5f * (a[n / 2 - 1] + a[n / 2]);
}

