lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static float median4_float(float a, float b, float c, float d) {
    float x[4] = {a, b, c, d};
    return median_float_array(x, 4);
}

static bool soil_voltage_valid(float v) {
    return (v >= SOIL_VOLTAGE_MIN_VALID && v <= SOIL_VOLTAGE_MAX_VALID);
}

typedef struct {
    float value;
    float lo;
    float hi;
    float width;
    float confidence;
    uint8_t valid_count;
    bool reliable;
} soil_fusion_result_t;

static soil_fusion_result_t soil_fuse_schmid_schossmaier_f1(const float soil_pct[SOIL_CH_COUNT],
                                                            const float soil_voltage[SOIL_CH_COUNT]) {
    const int n = SOIL_CH_COUNT;
    const int f = SOIL_FUSION_FAULT_TOLERANCE;
    const float err = SOIL_FUSION_ERROR_PERCENT;

    float lo[SOIL_CH_COUNT] = {0};
    float hi[SOIL_CH_COUNT] = {0};
    float s[SOIL_CH_COUNT] = {0};
    uint8_t valid_count = 0;

    for (int i = 0; i < n; i++) {
        s[i] = clampf_local(soil_pct[i], 0.0f, 100.0f);
        if (soil_voltage_valid(soil_voltage[i])) valid_count++;
        lo[i] = clampf_local(s[i] - err, 0.0f, 100.0f);
        hi[i] = clampf_local(s[i] + err, 0.0f, 100.0f);
    }

    sort_float_array(lo, n);
    sort_float_array(hi, n);

    soil_fusion_result_t out = {0};
    out.valid_count = valid_count;

    /* f+1-th largest lower bound and f+1-th smallest upper bound.
     * Với n=4, f=1: lower_idx=2, upper_idx=1.
     */
    int lower_idx = n - f - 1;
    int upper_idx = f;

    out.lo = lo[lower_idx];
    out.hi = hi[upper_idx];

    if (out.lo <= out.hi) {
        float med = median4_float(s[0], s[1], s[2], s[3]);
        out.value = clampf_local(med, out.lo, out.hi);
        out.width = out.hi - out.lo;
        out.confidence = clampf_local(1.0f - (out.width / 100.0f), 0.0f, 1.0f);
        out.reliable = (valid_count >= SOIL_MIN_VALID_COUNT);
    } else {
        /* Khoảng rỗng nghĩa là các cảm biến lệch nhau quá mạnh.
         * Fallback median để không bị trung bình kéo sai, nhưng hạ confidence.
         */
        out.value = median4_float(s[0], s[1], s[2], s[3]);
        out.lo = out.value;
        out.hi = out.value;
        out.width = 100.0f;
        out.confidence = 0.0f;
        out.reliable = false;
    }

    return out;
}

static void apply_sensor_filter_and_fusion(sensor_data_t *s) {
    if (!s) return;

    if (!s_filter.initialized) {
        s_filter.temperature = s->temperature;
        s_filter.air_humidity = s->air_humidity;
        s_filter.lux = s->lux;
        for (int i = 0; i < SOIL_CH_COUNT; i++) {
            s_filter.soil_pct[i] = s->soil_pct[i];
            s_filter.soil_voltage[i] = s->soil_voltage[i];
            s_filter.soil_jump_count[i] = 0;
            s_filter.soil_seen_active[i] = false;
            s_filter.soil_rail_high_streak[i] = 0;
            s_filter.soil_rail_low_streak[i] = 0;
        }
        strlcpy(s_filter.soil_presence_state, "UNKNOWN", sizeof(s_filter.soil_presence_state));
        s_filter.initialized = true;
    }

    if (s->dht11_ok) {
        if (absf_local(s->temperature - s_filter.temperature) <= TEMP_MAX_JUMP_C) {
            s_filter.temperature = ema_update(s_filter.temperature, s->temperature, FILTER_TEMP_ALPHA);
        }
        if (absf_local(s->air_humidity - s_filter.air_humidity) <= HUM_MAX_JUMP_PERCENT) {
            s_filter.air_humidity = ema_update(s_filter.air_humidity, s->air_humidity, FILTER_HUM_ALPHA);
        }
    }

    if (s->bh1750_ok) {
        s_filter.lux = ema_update(s_filter.lux, s->lux, FILTER_LUX_ALPHA);
    }

    uint8_t voltage_valid_count = 0;
    uint8_t active_now_count = 0;
    uint8_t rail_high_count = 0;
    uint8_t rail_low_count = 0;
    uint8_t removed_like_count = 0;
    uint8_t seen_active_count = 0;

    bool all_zero = true;
    float sum = 0.0f;
    float min_v = 100.0f;
    float max_v = 0.0f;

    for (int i = 0; i < SOIL_CH_COUNT; i++) {
        float vraw = s->soil_voltage[i];
        bool v_valid = soil_voltage_valid(vraw);
        bool rail_high = (vraw >= SOIL_RAIL_HIGH_V);
        bool rail_low = (vraw <= SOIL_RAIL_LOW_V);
        bool active_now = v_valid && !rail_high && !rail_low;

        if (v_valid) voltage_valid_count++;
        if (rail_high) rail_high_count++;
        if (rail_low) rail_low_count++;
        if (active_now) active_now_count++;

        if (active_now) {
            s_filter.soil_seen_active[i] = true;
            s_filter.soil_rail_high_streak[i] = 0;
            s_filter.soil_rail_low_streak[i] = 0;
        } else if (rail_high) {
            if (s_filter.soil_rail_high_streak[i] < 60000) s_filter.soil_rail_high_streak[i]++;
            s_filter.soil_rail_low_streak[i] = 0;
        } else if (rail_low) {
            if (s_filter.soil_rail_low_streak[i] < 60000) s_filter.soil_rail_low_streak[i]++;
            s_filter.soil_rail_high_streak[i] = 0;
        }

        if (s_filter.soil_seen_active[i]) seen_active_count++;
        if (s_filter.soil_seen_active[i] &&
            s_filter.soil_rail_high_streak[i] >= SOIL_REMOVED_CONFIRM_COUNT) {
            removed_like_count++;
        }

        /* EMA soil có recovery:
         * - Nhảy nhỏ: EMA bình thường alpha=0.10.
         * - Nhảy lớn 1-2 mẫu: giữ giá trị cũ để chống spike.
         * - Nhảy lớn >=3 mẫu: cập nhật nhanh alpha=0.40 để không kẹt khi cắm/tháo.
         */
        s_filter.soil_pct[i] = soil_ema_update_with_recovery(i,
                                                              s_filter.soil_pct[i],
                                                              s->soil_pct[i]);
        s_filter.soil_voltage[i] = vraw;

        if (s_filter.soil_pct[i] > 0.01f) all_zero = false;
        sum += s_filter.soil_pct[i];
        if (s_filter.soil_pct[i] < min_v) min_v = s_filter.soil_pct[i];
        if (s_filter.soil_pct[i] > max_v) max_v = s_filter.soil_pct[i];
    }

    if (all_zero) {
        if (s_filter.soil_zero_streak < 60000) {
            s_filter.soil_zero_streak++;
        }
    } else {
        s_filter.soil_zero_streak = 0;
    }

    bool all_rail_high = (rail_high_count == SOIL_CH_COUNT);
    bool all_rail_low = (rail_low_count == SOIL_CH_COUNT);
    bool stuck_zero = (s_filter.soil_zero_streak >= SOIL_ZERO_STUCK_LIMIT);
    bool saturated_dry = all_zero && all_rail_high;

    char presence[32] = "UNKNOWN";
    bool sensor_fault = false;

    if (voltage_valid_count < SOIL_MIN_VALID_COUNT) {
        strlcpy(presence, "VOLTAGE_INVALID", sizeof(presence));
        sensor_fault = true;
    } else if (all_rail_low) {
        strlcpy(presence, "SHORT_GND", sizeof(presence));
        sensor_fault = true;
    } else if (active_now_count >= SOIL_MIN_VALID_COUNT) {
        strlcpy(presence, "ACTIVE", sizeof(presence));
    } else if (all_rail_high && seen_active_count >= SOIL_MIN_VALID_COUNT &&
               removed_like_count >= SOIL_MIN_VALID_COUNT) {
        strlcpy(presence, "REMOVED_OR_EXTREME_DRY", sizeof(presence));
    } else if (all_rail_high) {
        strlcpy(presence, "OPEN_AIR_OR_DRY", sizeof(presence));
    } else if (active_now_count > 0) {
        strlcpy(presence, "PARTIAL_ACTIVE", sizeof(presence));
    } else {
        strlcpy(presence, "UNSTABLE", sizeof(presence));
    }

