lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    if (stuck_zero && !saturated_dry) {
        sensor_fault = true;
    }

    soil_fusion_result_t fusion = soil_fuse_schmid_schossmaier_f1(s_filter.soil_pct,
                                                                  s_filter.soil_voltage);

    bool control_reliable = fusion.reliable && !sensor_fault;
    /* Dữ liệu soil chỉ nên dùng cho AI bơm khi ít nhất 3/4 kênh đang ở vùng hoạt động.
     * OPEN_AIR_OR_DRY/REMOVED_OR_EXTREME_DRY không phải lúc nào là lỗi sensor,
     * nhưng không đủ chắc để tự động bật bơm trong lúc test tháo/cắm cảm biến.
     */
    if (strcmp(presence, "ACTIVE") != 0) {
        control_reliable = false;
    }

    s->temperature = clampf_local(s_filter.temperature, 0.0f, 60.0f);
    s->air_humidity = clampf_local(s_filter.air_humidity, 0.0f, 100.0f);
    s->lux = clampf_local(s_filter.lux, 0.0f, 120000.0f);

    for (int i = 0; i < SOIL_CH_COUNT; i++) {
        s->soil_pct[i] = clampf_local(s_filter.soil_pct[i], 0.0f, 100.0f);
        s->soil_voltage[i] = s_filter.soil_voltage[i];
    }

    s->soil_avg_raw = sum / SOIL_CH_COUNT;
    s->soil_min = min_v;
    s->soil_max = max_v;
    s->soil_fused = clampf_local(fusion.value, 0.0f, 100.0f);
    s->soil_fusion_lo = fusion.lo;
    s->soil_fusion_hi = fusion.hi;
    s->soil_fusion_confidence = fusion.confidence;
    s->soil_valid_count = voltage_valid_count;
    s->soil_zero_streak = s_filter.soil_zero_streak;
    s->soil_stuck_zero = stuck_zero;
    s->soil_saturated_dry = saturated_dry;
    s->soil_sensor_fault = sensor_fault;
    s->soil_control_reliable = control_reliable;
    s->soil_reliable = control_reliable;
    strlcpy(s->soil_presence_state, presence, sizeof(s->soil_presence_state));
    strlcpy(s->soil_fusion_method, "schmid_schossmaier_f1_median_ema_recovery", sizeof(s->soil_fusion_method));
}

static bool ads_read_channel_median_voltage(ads111x_mux_t mux, float *voltage_out) {
    if (!voltage_out) return false;

    float samples[SOIL_MEDIAN_SAMPLES] = {0};
    int count = 0;

    for (int k = 0; k < SOIL_MEDIAN_SAMPLES; k++) {
        if (ads111x_set_input_mux(&s_ads_dev, mux) != ESP_OK) return false;
        if (ads111x_start_conversion(&s_ads_dev) != ESP_OK) return false;

        vTaskDelay(pdMS_TO_TICKS(SOIL_SAMPLE_DELAY_MS));

        bool busy = true;
        for (int w = 0; w < 8 && busy; w++) {
            ads111x_is_busy(&s_ads_dev, &busy);
            if (busy) vTaskDelay(pdMS_TO_TICKS(2));
        }

        int16_t raw_v = 0;
        if (ads111x_get_value(&s_ads_dev, &raw_v) == ESP_OK) {
            samples[count++] = (float)((double)raw_v * 4.096 / 32767.0);
        }
    }

    if (count <= 0) return false;
    *voltage_out = median_float_array(samples, count);
    return true;
}

static bool mqtt_topic_match(esp_mqtt_event_handle_t ev, const char *topic) {
    size_t topic_len = strlen(topic);
    return (ev->topic_len == topic_len) &&
           (strncmp(ev->topic, topic, topic_len) == 0);
}

static bool rtc_get_phase_from_planting_time(int *phase_out,
                                             float *days_out,
                                             char *source,
                                             size_t source_len) {
    struct tm now = {0};
    if (!rtc_get_time_safe(&now) || now.tm_year <= 100) {
        if (phase_out) *phase_out = s_current_phase;
        if (days_out)  *days_out = -1.0f;
        if (source) strlcpy(source, "RTC_ERROR", source_len);
        return false;
    }

    if (!s_planting_start_valid || s_planting_start_epoch <= 0) {
        if (phase_out) *phase_out = s_current_phase;
        if (days_out)  *days_out = -1.0f;
        if (source) strlcpy(source, "NVS_NO_START", source_len);
        return false;
    }

    time_t now_epoch = tm_local_to_epoch(now);
    double diff_s = difftime(now_epoch, s_planting_start_epoch);
    float days = (float)(diff_s / 86400.0);
    if (days < 0.0f) days = 0.0f;

    int phase = (days < DARK_PHASE_DAYS) ? PHASE_1_DARK : PHASE_2_LIGHT;

    if (phase_out) *phase_out = phase;
    if (days_out)  *days_out = days;
    if (source) strlcpy(source, "ESP32_RTC_NVS", source_len);
    return true;
}

static bool rtc_get_hour_utc7(int *hour_out) {
    struct tm t = {0};
    if (rtc_get_time_safe(&t) && t.tm_year > 100) {
        *hour_out = t.tm_hour;
        return true;
    }
    return false;
}

static bool light_should_be_on_by_schedule(int phase, int hour_utc7) {
    if (phase != PHASE_2_LIGHT) {
        return false;   /* Phase 1: luôn tối */
    }

    if (LIGHT_ON_HOUR_UTC7 < LIGHT_OFF_HOUR_UTC7) {
        return (hour_utc7 >= LIGHT_ON_HOUR_UTC7 &&
                hour_utc7 <  LIGHT_OFF_HOUR_UTC7);
    }

    /* Trường hợp lịch qua nửa đêm, ví dụ 20h -> 6h */
    return (hour_utc7 >= LIGHT_ON_HOUR_UTC7 ||
            hour_utc7 <  LIGHT_OFF_HOUR_UTC7);
}

static int build_json(char *buf, size_t buf_len, const sensor_data_t *s, int step) {
    return snprintf(buf, buf_len,
        "{"
        "\"node_id\":\"%s\","
        "\"fw\":\"%s\","
        "\"timestamp\":\"%s\","
        "\"step\":%d,"
        "\"uptime_s\":%ld,"
        "\"phase\":%d,"
        "\"phase_source\":\"%s\","
        "\"days_after_planting\":%.3f,"
        "\"planting_start_epoch\":%lld,"
        "\"planting_start_valid\":%s,"
        "\"sensor\":{"
            "\"temperature\":%.1f,"
            "\"air_humidity\":%.1f,"
            "\"lux\":%.2f,"
            "\"soil_moisture_avg\":%.1f,"
            "\"soil_moisture_mean\":%.1f,"
            "\"soil_moisture_fused\":%.1f,"
            "\"soil_moisture_min\":%.1f,"
            "\"soil_moisture_max\":%.1f,"
            "\"soil_moisture_raw\":{"
                "\"s1\":%.1f,\"s2\":%.1f,\"s3\":%.1f,\"s4\":%.1f"
            "},"
            "\"soil_voltage_raw\":{"
                "\"v1\":%.3f,\"v2\":%.3f,\"v3\":%.3f,\"v4\":%.3f"
            "},"
            "\"soil_fusion\":{"
                "\"method\":\"%s\","
                "\"lo\":%.1f,"
                "\"hi\":%.1f,"
                "\"confidence\":%.2f,"
                "\"valid_count\":%u,"
                "\"presence_state\":\"%s\","
                "\"control_reliable\":%s,"
                "\"reliable\":%s,"
                "\"stuck_zero\":%s,"
                "\"saturated_dry\":%s,"
                "\"sensor_fault\":%s,"
                "\"zero_streak\":%u"
            "}"
        "},"
        "\"status\":{"
            "\"wifi_rssi\":%d,"
            "\"dht11_ok\":%s,"
            "\"bh1750_ok\":%s,"
            "\"ads1115_ok\":%s,"
            "\"rtc_ok\":%s,"
            "\"pump_on\":%s,"
            "\"pump_mode\":\"%s\","
            "\"pump_reason\":\"%s\","
            "\"light_on\":%s,"
            "\"light_mode\":\"%s\","
            "\"light_reason\":\"%s\""
        "}"
        "}",
        NODE_ID, FW_VERSION, s->iso_time, step,
        s->uptime_s, s->phase,
        s->phase_source[0] ? s->phase_source : "UNKNOWN",
        s->days_after_planting,
        (long long)s_planting_start_epoch,
        s_planting_start_valid ? "true" : "false",
        s->temperature, s->air_humidity, s->lux,
        s->soil_fused, s->soil_avg_raw, s->soil_fused, s->soil_min, s->soil_max,
        s->soil_pct[0], s->soil_pct[1], s->soil_pct[2], s->soil_pct[3],
        s->soil_voltage[0], s->soil_voltage[1], s->soil_voltage[2], s->soil_voltage[3],
        s->soil_fusion_method[0] ? s->soil_fusion_method : "none",
        s->soil_fusion_lo, s->soil_fusion_hi, s->soil_fusion_confidence,
        (unsigned)s->soil_valid_count,
        s->soil_presence_state[0] ? s->soil_presence_state : "UNKNOWN",
        s->soil_control_reliable ? "true" : "false",
        s->soil_reliable ? "true" : "false",
        s->soil_stuck_zero ? "true" : "false",
        s->soil_saturated_dry ? "true" : "false",
        s->soil_sensor_fault ? "true" : "false",
        (unsigned)s->soil_zero_streak,
        s->wifi_rssi,
        s->dht11_ok   ? "true" : "false",
        s->bh1750_ok  ? "true" : "false",
        s->ads1115_ok ? "true" : "false",
        s->rtc_ok     ? "true" : "false",
        s->pump_state ? "true" : "false",
        s->pump_mode[0] ? s->pump_mode : "AI_AUTO",
        s->pump_reason[0] ? s->pump_reason : "UNKNOWN",
        s->light_state ? "true" : "false",
        s->light_mode[0] ? s->light_mode : "AUTO_RTC",
        s->light_reason[0] ? s->light_reason : "UNKNOWN"
    );
}

static const char *phase_to_text(int phase) {
    switch (phase) {
        case PHASE_1_DARK:  return "PHASE1_DARK";
        case PHASE_2_LIGHT: return "PHASE2_LIGHT";
        default:            return "UNKNOWN";
    }
}

static float soil_avg_from_snapshot(const sensor_data_t *s) {
    if (!s) return 0.0f;
    return s->soil_fused;
}


/* ================================================================
   DIGITAL TWIN DIRECT CONTROL HELPERS
   ================================================================ */

static bool pump_direct_active(void) {
    return (s_pump_direct_until_us > 0 && esp_timer_get_time() < s_pump_direct_until_us);
}

static bool light_direct_active(void) {
    return (s_light_direct_until_us > 0 && esp_timer_get_time() < s_light_direct_until_us);
}

