lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static void mqtt_data_to_cstr(esp_mqtt_event_handle_t ev, char *out, size_t out_len) {
    if (!out || out_len == 0) return;
    size_t n = (ev->data_len < (int)(out_len - 1)) ? ev->data_len : (out_len - 1);
    memcpy(out, ev->data, n);
    out[n] = '\0';
}

static bool json_get_string_value(const char *json, const char *key, char *out, size_t out_len) {
    if (!json || !key || !out || out_len == 0) return false;
    char pattern[32];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *p = strstr(json, pattern);
    if (!p) return false;
    p = strchr(p + strlen(pattern), ':');
    if (!p) return false;
    p++;
    while (*p == ' ' || *p == '\t') p++;
    if (*p != '"') return false;
    p++;
    size_t i = 0;
    while (*p && *p != '"' && i + 1 < out_len) {
        out[i++] = *p++;
    }
    out[i] = '\0';
    return i > 0;
}

static int json_get_int_value(const char *json, const char *key, int default_value) {
    if (!json || !key) return default_value;
    char pattern[32];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *p = strstr(json, pattern);
    if (!p) return default_value;
    p = strchr(p + strlen(pattern), ':');
    if (!p) return default_value;
    p++;
    while (*p == ' ' || *p == '\t') p++;
    return atoi(p);
}

static bool parse_on_off_command(const char *payload, bool default_on) {
    char state[16] = {0};
    if (json_get_string_value(payload, "state", state, sizeof(state)) ||
        json_get_string_value(payload, "cmd", state, sizeof(state)) ||
        json_get_string_value(payload, "action", state, sizeof(state))) {
        return (strcasecmp(state, "ON") == 0 ||
                strcasecmp(state, "PUMP_ON") == 0 ||
                strcasecmp(state, "LIGHT_ON") == 0 ||
                strcmp(state, "1") == 0 ||
                strcasecmp(state, "TRUE") == 0);
    }

    if (strstr(payload, "ON") || strstr(payload, "on") || strstr(payload, "true") || strstr(payload, "1")) {
        return true;
    }
    if (strstr(payload, "OFF") || strstr(payload, "off") || strstr(payload, "false") || strstr(payload, "0")) {
        return false;
    }
    return default_on;
}

static int parse_duration_s(const char *payload, int default_s, int max_s) {
    int d = json_get_int_value(payload, "duration_s", -1);
    if (d < 0) d = json_get_int_value(payload, "duration", -1);
    if (d < 0) d = default_s;
    if (d < 0) d = 0;
    if (d > max_s) d = max_s;
    return d;
}

static int64_t json_get_int64_value(const char *json, const char *key, int64_t default_value) {
    if (!json || !key) return default_value;
    char pattern[40];
    snprintf(pattern, sizeof(pattern), "\"%s\"", key);
    const char *p = strstr(json, pattern);
    if (!p) return default_value;
    p = strchr(p + strlen(pattern), ':');
    if (!p) return default_value;
    p++;
    while (*p == ' ' || *p == '\t' || *p == '"') p++;
    return strtoll(p, NULL, 10);
}

static bool planting_command_is_duplicate(const char *cmd_id) {
    return (cmd_id && cmd_id[0] && s_last_planting_cmd_id[0] &&
            strncmp(cmd_id, s_last_planting_cmd_id, sizeof(s_last_planting_cmd_id)) == 0);
}

static void publish_planting_status(const char *event, const char *cmd_id, const char *status, const char *reason) {
    if (!s_mqtt_connected || !s_mqtt) return;

    char start_iso[32];
    char now_iso[32];
    epoch_to_iso_utc7(s_planting_start_epoch, start_iso, sizeof(start_iso));
    rtc_get_iso(now_iso, sizeof(now_iso));

    char payload[512];
    int len = snprintf(payload, sizeof(payload),
        "{"
        "\"node_id\":\"%s\","
        "\"event\":\"%s\","
        "\"target\":\"planting_start\","
        "\"command_id\":\"%s\","
        "\"status\":\"%s\","
        "\"source\":\"ESP32_NVS\","
        "\"planting_start_epoch\":%lld,"
        "\"planting_start_time\":\"%s\","
        "\"planting_start_valid\":%s,"
        "\"reason\":\"%s\","
        "\"timestamp\":\"%s\""
        "}",
        NODE_ID,
        event ? event : "planting_start_status",
        cmd_id ? cmd_id : "",
        status ? status : "OK",
        (long long)s_planting_start_epoch,
        start_iso,
        s_planting_start_valid ? "true" : "false",
        reason ? reason : "",
        now_iso);

    if (len > 0) esp_mqtt_client_publish(s_mqtt, TOPIC_STATUS_ESP32, payload, len, MQTT_QOS, 0);
}

static bool planting_start_init_from_nvs_or_rtc(void) {
    /* v2.9.3: NVS chỉ là cache local.
     * Không tự tạo start_epoch=now khi NVS rỗng, vì làm che lỗi đồng bộ Unity/DB -> Gateway -> ESP32.
     * Gateway sẽ reconcile DB desired_epoch với ESP32 actual_epoch và gửi SET_EPOCH khi cần.
     */
    if (planting_start_load_from_nvs()) return true;

    s_planting_start_epoch = 0;
    s_planting_start_valid = false;
    s_last_planting_cmd_id[0] = '\0';
    ESP_LOGW(TAG, "PLANTING: NVS chưa có start_epoch -> valid=false, chờ Gateway/Unity SET_EPOCH");
    return false;
}

static bool planting_start_save_verified(time_t epoch, const char *cmd_id) {
    if (epoch <= 0) return false;

    if (!planting_start_save_to_nvs(epoch, cmd_id)) {
        return false;
    }

    /* Đọc lại NVS để xác nhận đã commit đúng epoch. */
    s_planting_start_epoch = 0;
    s_planting_start_valid = false;
    s_last_planting_cmd_id[0] = '\0';

    if (!planting_start_load_from_nvs()) {
        ESP_LOGE(TAG, "PLANTING: verify failed, không đọc lại được NVS sau khi save");
        return false;
    }

    if (!s_planting_start_valid || s_planting_start_epoch != epoch) {
        ESP_LOGE(TAG, "PLANTING: verify mismatch, expected=%lld actual=%lld",
                 (long long)epoch, (long long)s_planting_start_epoch);
        return false;
    }

    return true;
}

static void handle_planting_start_command(esp_mqtt_event_handle_t ev) {
    char payload[320];
    char action[24] = {0};
    char cmd_id[PLANTING_CMD_ID_MAX] = {0};
    char reason[64] = {0};
    mqtt_data_to_cstr(ev, payload, sizeof(payload));

    json_get_string_value(payload, "command_id", cmd_id, sizeof(cmd_id));
    if (!cmd_id[0]) json_get_string_value(payload, "id", cmd_id, sizeof(cmd_id));
    if (!cmd_id[0]) snprintf(cmd_id, sizeof(cmd_id), "mqtt-%lld", (long long)(esp_timer_get_time() / 1000));

    if (planting_command_is_duplicate(cmd_id)) {
        ESP_LOGW(TAG, "PLANTING: bỏ qua command trùng cmd_id=%s", cmd_id);
        publish_planting_status("planting_start_duplicate", cmd_id, "DUPLICATE", "duplicate_command_id");
        return;
    }

