lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    if (!json_get_string_value(payload, "action", action, sizeof(action))) strlcpy(action, "SET_NOW", sizeof(action));
    json_get_string_value(payload, "reason", reason, sizeof(reason));

    if (strcasecmp(action, "SET_NOW") == 0) {
        time_t now_epoch = 0;
        if (!rtc_get_epoch_from_ds3231(&now_epoch)) {
            ESP_LOGE(TAG, "PLANTING: SET_NOW thất bại vì RTC invalid");
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "rtc_invalid");
            return;
        }
        if (planting_start_save_verified(now_epoch, cmd_id)) {
            publish_planting_status("planting_start_updated", cmd_id, "DONE", reason[0] ? reason : "SET_NOW");
        } else {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "nvs_save_verify_failed");
        }
    } else if (strcasecmp(action, "SET_EPOCH") == 0) {
        int64_t epoch = json_get_int64_value(payload, "planting_start_epoch", 0);
        if (epoch <= 0) epoch = json_get_int64_value(payload, "epoch", 0);
        if (epoch <= 0) {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "missing_epoch");
            return;
        }
        if (planting_start_save_verified((time_t)epoch, cmd_id)) {
            publish_planting_status("planting_start_updated", cmd_id, "DONE", reason[0] ? reason : "SET_EPOCH");
        } else {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "nvs_save_verify_failed");
        }
    } else if (strcasecmp(action, "CLEAR") == 0) {
        if (planting_start_clear_nvs()) {
            publish_planting_status("planting_start_cleared", cmd_id, "DONE", reason[0] ? reason : "CLEAR");
        } else {
            publish_planting_status("planting_start_error", cmd_id, "ERROR", "nvs_clear_failed");
        }
    } else if (strcasecmp(action, "GET") == 0) {
        publish_planting_status("planting_start_current", cmd_id, "DONE", reason[0] ? reason : "GET");
    } else {
        ESP_LOGW(TAG, "PLANTING: action không hỗ trợ: %s", action);
        publish_planting_status("planting_start_error", cmd_id, "ERROR", "unsupported_action");
    }
}

static void publish_actuator_state(const char *event_reason) {
    if (!s_mqtt_connected || !s_mqtt) return;

    sensor_data_t snap;
    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        snap = g_sensor;
        xSemaphoreGive(s_sensor_mutex);
    } else {
        return;
    }

    char ts[32] = {0};
    rtc_get_iso(ts, sizeof(ts));

    char payload[768];
    int len = snprintf(payload, sizeof(payload),
        "{"
        "\"node_id\":\"%s\","
        "\"timestamp\":\"%s\","
        "\"event\":\"%s\","
        "\"last_pump_command_id\":\"%s\","
        "\"last_pump_seq\":%d,"
        "\"last_light_command_id\":\"%s\","
        "\"last_light_seq\":%d,"
        "\"pump\":{\"state\":\"%s\",\"mode\":\"%s\",\"reason\":\"%s\"},"
        "\"light\":{\"state\":\"%s\",\"mode\":\"%s\",\"reason\":\"%s\"}"
        "}",
        NODE_ID, ts, event_reason ? event_reason : "STATE",
        s_last_pump_cmd_id[0] ? s_last_pump_cmd_id : "",
        s_last_pump_cmd_seq,
        s_last_light_cmd_id[0] ? s_last_light_cmd_id : "",
        s_last_light_cmd_seq,
        snap.pump_state ? "ON" : "OFF",
        snap.pump_mode[0] ? snap.pump_mode : "AI_AUTO",
        snap.pump_reason[0] ? snap.pump_reason : "UNKNOWN",
        snap.light_state ? "ON" : "OFF",
        snap.light_mode[0] ? snap.light_mode : "AUTO_RTC",
        snap.light_reason[0] ? snap.light_reason : "UNKNOWN");

    if (len > 0) {
        esp_mqtt_client_publish(s_mqtt, TOPIC_ACTUATOR_STATE, payload, len, MQTT_QOS, 0);
    }
}

static void set_pump_state(bool on, const char *mode, const char *reason) {
    gpio_set_level(RELAY_PUMP_GPIO, on ? 1 : 0);
    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        g_sensor.pump_state = on;
        strlcpy(g_sensor.pump_mode, mode ? mode : "AI_AUTO", sizeof(g_sensor.pump_mode));
        strlcpy(g_sensor.pump_reason, reason ? reason : "UNKNOWN", sizeof(g_sensor.pump_reason));
        xSemaphoreGive(s_sensor_mutex);
    }
}

static void set_light_state(bool on, const char *mode, const char *reason) {
    gpio_set_level(RELAY_LIGHT_GPIO, on ? 1 : 0);
    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        g_sensor.light_state = on;
        strlcpy(g_sensor.light_mode, mode ? mode : "AUTO_RTC", sizeof(g_sensor.light_mode));
        strlcpy(g_sensor.light_reason, reason ? reason : "UNKNOWN", sizeof(g_sensor.light_reason));
        xSemaphoreGive(s_sensor_mutex);
    }
}

static void handle_auto_pump_command(esp_mqtt_event_handle_t ev) {
    char payload[256];
    mqtt_data_to_cstr(ev, payload, sizeof(payload));

    if (pump_direct_active()) {
        ESP_LOGW(TAG, "Ignore Gateway auto pump while direct command active: %s", payload);
        return;
    }

    bool on = parse_on_off_command(payload, false);

    if (on) {
        bool soil_ok_for_control = true;
        char presence[32] = "UNKNOWN";
        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            soil_ok_for_control = g_sensor.soil_control_reliable;
            strlcpy(presence,
                    g_sensor.soil_presence_state[0] ? g_sensor.soil_presence_state : "UNKNOWN",
                    sizeof(presence));
            xSemaphoreGive(s_sensor_mutex);
        }

        if (!soil_ok_for_control) {
            set_pump_state(false, "AI_AUTO", "SOIL_UNRELIABLE_BLOCK_ON");
            ESP_LOGW(TAG, "Block Gateway AUTO Pump ON: soil not reliable for control, presence=%s payload=%s",
                     presence, payload);
            publish_actuator_state("GATEWAY_CMD_PUMP_BLOCKED");
            return;
        }
    }

    set_pump_state(on, "AI_AUTO", "GATEWAY_AI_AUTO");
    ESP_LOGI(TAG, "Gateway AUTO command: Pump -> %s", on ? "ON" : "OFF");
    publish_actuator_state("GATEWAY_CMD_PUMP");
}

static void handle_dt_pump_command(esp_mqtt_event_handle_t ev) {
    char payload[256];
    char reason[32] = {0};
    char cmd_id[DIRECT_CMD_ID_MAX] = {0};
    mqtt_data_to_cstr(ev, payload, sizeof(payload));

    json_get_string_value(payload, "command_id", cmd_id, sizeof(cmd_id));
    if (!cmd_id[0]) json_get_string_value(payload, "id", cmd_id, sizeof(cmd_id));
    if (cmd_id[0]) strlcpy(s_last_pump_cmd_id, cmd_id, sizeof(s_last_pump_cmd_id));
    s_last_pump_cmd_seq = json_get_int_value(payload, "seq", s_last_pump_cmd_seq);

    bool on = parse_on_off_command(payload, false);
    int duration_s = parse_duration_s(payload, DT_PUMP_DEFAULT_DURATION_S, DT_PUMP_MAX_DURATION_S);
    if (!json_get_string_value(payload, "reason", reason, sizeof(reason))) {
        strlcpy(reason, on ? "DT_DIRECT_ON" : "DT_DIRECT_OFF", sizeof(reason));
    }

    if (on) {
        s_pump_direct_until_us = esp_timer_get_time() + ((int64_t)duration_s * 1000000LL);
        set_pump_state(true, "DIRECT_DT", reason);
    } else {
        s_pump_direct_until_us = esp_timer_get_time() + 2000000LL;  /* giữ quyền 2s để tránh Gateway gửi ngược ngay */
        set_pump_state(false, "DIRECT_DT", reason);
    }

    ESP_LOGW(TAG, "DT command: Pump -> %s duration=%ds reason=%s cmd_id=%s seq=%d",
             on ? "ON" : "OFF", duration_s, reason,
             s_last_pump_cmd_id[0] ? s_last_pump_cmd_id : "NONE", s_last_pump_cmd_seq);
    publish_actuator_state("DT_CMD_PUMP");
}

