lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
static void handle_dt_light_command(esp_mqtt_event_handle_t ev, const char *mode_name) {
    char payload[256];
    char reason[32] = {0};
    char cmd_id[DIRECT_CMD_ID_MAX] = {0};
    mqtt_data_to_cstr(ev, payload, sizeof(payload));

    json_get_string_value(payload, "command_id", cmd_id, sizeof(cmd_id));
    if (!cmd_id[0]) json_get_string_value(payload, "id", cmd_id, sizeof(cmd_id));
    if (cmd_id[0]) strlcpy(s_last_light_cmd_id, cmd_id, sizeof(s_last_light_cmd_id));
    s_last_light_cmd_seq = json_get_int_value(payload, "seq", s_last_light_cmd_seq);

    bool on = parse_on_off_command(payload, false);
    int duration_s = parse_duration_s(payload, DT_LIGHT_DEFAULT_DURATION_S, DT_LIGHT_MAX_DURATION_S);
    if (!json_get_string_value(payload, "reason", reason, sizeof(reason))) {
        strlcpy(reason, on ? "DT_LIGHT_ON" : "DT_LIGHT_OFF", sizeof(reason));
    }

    if (on) {
        s_light_direct_until_us = esp_timer_get_time() + ((int64_t)duration_s * 1000000LL);
        set_light_state(true, mode_name ? mode_name : "DIRECT_DT", reason);
    } else {
        s_light_direct_until_us = esp_timer_get_time() + 2000000LL;
        set_light_state(false, mode_name ? mode_name : "DIRECT_DT", reason);
    }

    ESP_LOGW(TAG, "%s command: Light -> %s duration=%ds reason=%s cmd_id=%s seq=%d",
             mode_name ? mode_name : "DT", on ? "ON" : "OFF", duration_s, reason,
             s_last_light_cmd_id[0] ? s_last_light_cmd_id : "NONE", s_last_light_cmd_seq);
    publish_actuator_state("DT_CMD_LIGHT");
}

static void log_sensor_snapshot(const sensor_data_t *s, int step, int ring_used) {
    ESP_LOGI(TAG,
             "SENSOR step=%d phase=%d(%s) source=%s days=%.2f rtc=%s time=%s | "
             "T=%.1fC RH=%.1f%% Lux=%.2f SoilFused=%.1f%% Avg=%.1f%% Min=%.1f%% Max=%.1f%% "
             "S[%.1f %.1f %.1f %.1f] V[%.3f %.3f %.3f %.3f] "
             "fusion=[%.1f..%.1f] conf=%.2f presence=%s reliable=%s control=%s valid=%u stuck0=%s/%u dry=%s fault=%s | "
             "Pump=%s Light=%s/%s reason=%s | RSSI=%d MQTT=%s Buffer=%d/%d",
             step, s->phase, phase_to_text(s->phase),
             s->phase_source[0] ? s->phase_source : "UNKNOWN",
             s->days_after_planting,
             s->rtc_ok ? "OK" : "ERR", s->iso_time,
             s->temperature, s->air_humidity, s->lux,
             s->soil_fused, s->soil_avg_raw, s->soil_min, s->soil_max,
             s->soil_pct[0], s->soil_pct[1], s->soil_pct[2], s->soil_pct[3],
             s->soil_voltage[0], s->soil_voltage[1], s->soil_voltage[2], s->soil_voltage[3],
             s->soil_fusion_lo, s->soil_fusion_hi, s->soil_fusion_confidence,
             s->soil_presence_state[0] ? s->soil_presence_state : "UNKNOWN",
             s->soil_reliable ? "YES" : "NO",
             s->soil_control_reliable ? "YES" : "NO",
             (unsigned)s->soil_valid_count,
             s->soil_stuck_zero ? "YES" : "NO",
             (unsigned)s->soil_zero_streak,
             s->soil_saturated_dry ? "YES" : "NO",
             s->soil_sensor_fault ? "YES" : "NO",
             s->pump_state ? "ON" : "OFF",
             s->light_state ? "ON" : "OFF",
             s->light_mode[0] ? s->light_mode : "AUTO_RTC",
             s->light_reason[0] ? s->light_reason : "UNKNOWN",
             s->wifi_rssi, s_mqtt_connected ? "ON" : "OFF",
             ring_used, RING_BUF_SIZE);
}

/* ================================================================
   WIFI EVENT HANDLER DÀNH CHO MULTI-WIFI — SAFE SCAN, KHÔNG CRASH
   ================================================================ */

static const char *wifi_reason_to_text(uint8_t reason) {
    /* Dùng numeric code để tương thích nhiều phiên bản ESP-IDF.
       Các mã hay gặp:
       15  = 4-way handshake timeout
       200 = beacon timeout
       201 = no AP found
       202 = auth fail / sai mật khẩu hoặc security không tương thích
       203 = association fail
       204 = handshake timeout
    */
    switch (reason) {
        case 2:   return "AUTH_EXPIRE";
        case 3:   return "AUTH_LEAVE";
        case 4:   return "ASSOC_EXPIRE";
        case 5:   return "ASSOC_TOOMANY";
        case 6:   return "NOT_AUTHED";
        case 7:   return "NOT_ASSOCED";
        case 8:   return "ASSOC_LEAVE";
        case 9:   return "ASSOC_NOT_AUTHED";
        case 10:  return "DISASSOC_PWRCAP_BAD";
        case 11:  return "DISASSOC_SUPCHAN_BAD";
        case 13:  return "IE_INVALID";
        case 14:  return "MIC_FAILURE";
        case 15:  return "4WAY_HANDSHAKE_TIMEOUT";
        case 16:  return "GROUP_KEY_UPDATE_TIMEOUT";
        case 17:  return "IE_IN_4WAY_DIFFERS";
        case 18:  return "GROUP_CIPHER_INVALID";
        case 19:  return "PAIRWISE_CIPHER_INVALID";
        case 20:  return "AKMP_INVALID";
        case 21:  return "UNSUPP_RSN_IE_VERSION";
        case 22:  return "INVALID_RSN_IE_CAP";
        case 23:  return "802_1X_AUTH_FAILED";
        case 24:  return "CIPHER_SUITE_REJECTED";
        case 200: return "BEACON_TIMEOUT";
        case 201: return "NO_AP_FOUND";
        case 202: return "AUTH_FAIL";
        case 203: return "ASSOC_FAIL";
        case 204: return "HANDSHAKE_TIMEOUT";
        default:  return "UNKNOWN";
    }
}

static const char *wifi_auth_to_text(wifi_auth_mode_t auth) {
    switch (auth) {
        case WIFI_AUTH_OPEN:            return "OPEN";
        case WIFI_AUTH_WEP:             return "WEP";
        case WIFI_AUTH_WPA_PSK:         return "WPA";
        case WIFI_AUTH_WPA2_PSK:        return "WPA2";
        case WIFI_AUTH_WPA_WPA2_PSK:    return "WPA/WPA2";
        case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2_ENT";
        case WIFI_AUTH_WPA3_PSK:        return "WPA3";
        case WIFI_AUTH_WPA2_WPA3_PSK:   return "WPA2/WPA3";
        default:                        return "UNKNOWN";
    }
}

static bool wifi_apply_config(int index) {
    if (index < 0 || index >= (int)WIFI_NETWORK_COUNT) {
        ESP_LOGE(TAG, "WiFi index không hợp lệ: %d", index);
        return false;
    }

    wifi_config_t wifi_config = {0};
    strlcpy((char *)wifi_config.sta.ssid,
            WIFI_NETWORKS[index].ssid,
            sizeof(wifi_config.sta.ssid));
    strlcpy((char *)wifi_config.sta.password,
            WIFI_NETWORKS[index].password,
            sizeof(wifi_config.sta.password));

    /* Để tương thích router/hotspot WPA/WPA2/WPA3 mixed tốt hơn, không ép quá cứng WPA2. */
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA_PSK;
    wifi_config.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
    wifi_config.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;

    esp_err_t err = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_wifi_set_config(%s) lỗi: %s",
                 WIFI_NETWORKS[index].ssid, esp_err_to_name(err));
        return false;
    }

    s_current_wifi_index = index;
    ESP_LOGI(TAG, "WiFi config: SSID=%s", WIFI_NETWORKS[index].ssid);
    return true;
}

/**
 * @brief Scan WiFi an toàn. Không dùng ESP_ERROR_CHECK vì scan có thể timeout tạm thời.
 * @return index mạng quen thuộc có RSSI tốt nhất; nếu không scan được hoặc không thấy thì trả về index hiện tại.
 */
static int wifi_scan_select_best_known(void) {
    wifi_ap_record_t ap_records[WIFI_SCAN_MAX_AP];
    uint16_t ap_count = WIFI_SCAN_MAX_AP;
    memset(ap_records, 0, sizeof(ap_records));

    wifi_scan_config_t scan_config = {
        .ssid = NULL,
        .bssid = NULL,
        .channel = 0,              /* 0 = quét tất cả channel */
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
        .scan_time.active.min = WIFI_SCAN_MIN_MS,
        .scan_time.active.max = WIFI_SCAN_MAX_MS,
    };

    ESP_LOGI(TAG, "Scan WiFi an toàn: all channel, max_ap=%d, active=%d-%dms",
             WIFI_SCAN_MAX_AP, WIFI_SCAN_MIN_MS, WIFI_SCAN_MAX_MS);

    esp_err_t err = esp_wifi_scan_start(&scan_config, true);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Scan WiFi lỗi: %s — bỏ qua scan, vẫn connect trực tiếp SSID đã cấu hình",
                 esp_err_to_name(err));
        return s_current_wifi_index;
    }

    err = esp_wifi_scan_get_ap_records(&ap_count, ap_records);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Lấy AP records lỗi: %s — bỏ qua scan", esp_err_to_name(err));
        return s_current_wifi_index;
    }

    ESP_LOGI(TAG, "Scan thấy %d mạng WiFi:", ap_count);

