lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
    int best_index = -1;
    int best_rssi = -999;

    for (int i = 0; i < ap_count; i++) {
        const char *ssid = (const char *)ap_records[i].ssid;
        const char *print_ssid = (ssid && ssid[0]) ? ssid : "<hidden>";
        ESP_LOGI(TAG, "  [%02d] SSID=%s | RSSI=%d | CH=%d | AUTH=%s",
                 i + 1, print_ssid, ap_records[i].rssi,
                 ap_records[i].primary, wifi_auth_to_text(ap_records[i].authmode));

        for (int k = 0; k < (int)WIFI_NETWORK_COUNT; k++) {
            if (ssid && strcmp(ssid, WIFI_NETWORKS[k].ssid) == 0) {
                if (ap_records[i].rssi > best_rssi) {
                    best_rssi = ap_records[i].rssi;
                    best_index = k;
                }
            }
        }
    }

    if (best_index >= 0) {
        ESP_LOGI(TAG, "Chọn WiFi quen thuộc mạnh nhất: %s (RSSI=%d)",
                 WIFI_NETWORKS[best_index].ssid, best_rssi);
        return best_index;
    }

    ESP_LOGW(TAG, "Không thấy SSID quen thuộc trong scan — vẫn thử connect trực tiếp SSID hiện tại: %s",
             WIFI_NETWORKS[s_current_wifi_index].ssid);
    return s_current_wifi_index;
}

static void wifi_connect_current(void) {
    esp_err_t err = esp_wifi_connect();
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "esp_wifi_connect(%s) lỗi mềm: %s",
                 WIFI_NETWORKS[s_current_wifi_index].ssid, esp_err_to_name(err));
    }
}

/**
 * @brief Chuyển đổi sang điểm truy cập WiFi tiếp theo trong danh sách, không crash nếu set_config lỗi.
 */
static void wifi_switch_to_next_network(void) {
    int next = (s_current_wifi_index + 1) % WIFI_NETWORK_COUNT;
    s_wifi_retry_count = 0;

    ESP_LOGI(TAG, "==> Đổi sang WiFi tiếp theo: %s", WIFI_NETWORKS[next].ssid);
    if (wifi_apply_config(next)) {
        wifi_connect_current();
    }

    /* Nếu đã duyệt hết 1 vòng mảng WiFi mà vẫn chưa kết nối, báo offline nhưng vẫn tiếp tục retry. */
    if (next == 0) {
        xEventGroupSetBits(s_wifi_eg, WIFI_FAIL_BIT);
    }
}

static void wifi_event_handler(void *arg, esp_event_base_t base,
                                int32_t id, void *data) {
    if (base == WIFI_EVENT && id == WIFI_EVENT_STA_START) {
        ESP_LOGI(TAG, "WiFi STA started");
    } else if (base == WIFI_EVENT && id == WIFI_EVENT_STA_DISCONNECTED) {
        s_mqtt_connected = false;
        xEventGroupClearBits(s_wifi_eg, WIFI_CONNECTED_BIT);

        wifi_event_sta_disconnected_t *event = (wifi_event_sta_disconnected_t *)data;
        uint8_t reason = event ? event->reason : 0;

        ESP_LOGW(TAG, "WiFi disconnected | SSID=%s | reason=%u(%s) | retry=%d/%d",
                 WIFI_NETWORKS[s_current_wifi_index].ssid,
                 reason, wifi_reason_to_text(reason),
                 s_wifi_retry_count, WIFI_MAX_RETRY);

        if (s_wifi_retry_count < WIFI_MAX_RETRY) {
            s_wifi_retry_count++;
            ESP_LOGW(TAG, "Thử kết nối lại %d/%d với SSID: %s",
                     s_wifi_retry_count, WIFI_MAX_RETRY,
                     WIFI_NETWORKS[s_current_wifi_index].ssid);
            wifi_connect_current();
        } else {
            ESP_LOGE(TAG, "Kết nối [%s] thất bại sau %d lần — đổi mạng",
                     WIFI_NETWORKS[s_current_wifi_index].ssid, WIFI_MAX_RETRY);
            wifi_switch_to_next_network();
        }
    } else if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *) data;
        ESP_LOGI(TAG, "WiFi connected | IP=" IPSTR " | GW=" IPSTR " | SSID=%s",
                 IP2STR(&event->ip_info.ip), IP2STR(&event->ip_info.gw),
                 WIFI_NETWORKS[s_current_wifi_index].ssid);
        s_wifi_retry_count = 0;
        xEventGroupClearBits(s_wifi_eg, WIFI_FAIL_BIT);
        xEventGroupSetBits(s_wifi_eg, WIFI_CONNECTED_BIT);
    }
}

static void wifi_init(void) {
    s_wifi_eg = xEventGroupCreate();
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                        wifi_event_handler, NULL, NULL);
    esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                        wifi_event_handler, NULL, NULL);

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));

    /* Việt Nam dùng channel 1-13. Nếu để mặc định US, mạng ở channel 12/13 có thể không thấy. */
    wifi_country_t country = {
        .cc = "VN",
        .schan = 1,
        .nchan = 13,
        .policy = WIFI_COUNTRY_POLICY_MANUAL,
    };
    esp_err_t country_err = esp_wifi_set_country(&country);
    if (country_err != ESP_OK) {
        ESP_LOGW(TAG, "set_country(VN) lỗi mềm: %s", esp_err_to_name(country_err));
    }

    /* Đặt cấu hình mặc định trước khi start. */
    wifi_apply_config(s_current_wifi_index);

    ESP_ERROR_CHECK(esp_wifi_start());
    vTaskDelay(pdMS_TO_TICKS(500));

    /* Scan chỉ để chọn SSID tốt hơn và debug. Nếu scan timeout thì không crash. */
    int selected = wifi_scan_select_best_known();
    wifi_apply_config(selected);
    wifi_connect_current();

    EventBits_t bits = xEventGroupWaitBits(s_wifi_eg,
        WIFI_CONNECTED_BIT | WIFI_FAIL_BIT, pdFALSE, pdFALSE,
        pdMS_TO_TICKS(WIFI_BOOT_WAIT_MS));

    if (bits & WIFI_CONNECTED_BIT) {
        ESP_LOGI(TAG, "Boot WiFi hoàn tất");
    } else {
        ESP_LOGW(TAG, "WiFi boot chưa kết nối sau %dms — chuyển sang Offline, task WiFi vẫn tiếp tục retry",
                 WIFI_BOOT_WAIT_MS);
    }
}

/* ================================================================
   MQTT EVENT HANDLER
   ================================================================ */

static void mqtt_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data) {
    esp_mqtt_event_handle_t ev = (esp_mqtt_event_handle_t)data;
    switch ((esp_mqtt_event_id_t)id) {
        case MQTT_EVENT_CONNECTED:
            s_mqtt_connected = true;
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_PUMP_AUTO, MQTT_QOS);
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_PUMP_DIRECT, MQTT_QOS);
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_LIGHT_DIRECT, MQTT_QOS);
            esp_mqtt_client_subscribe(s_mqtt, TOPIC_CMD_PLANTING_START, MQTT_QOS);
            ESP_LOGI(TAG,
                     "MQTT connected %s:%d — sub: auto/pump, direct/pump, direct/light, config/planting_start | buffer=%d/%d",
                     MQTT_BROKER_URI, MQTT_PORT, ring_count(), RING_BUF_SIZE);
            publish_actuator_state("MQTT_CONNECTED");
            publish_planting_status("planting_start_current", "", "DONE", "MQTT_CONNECTED");
            break;
        case MQTT_EVENT_DISCONNECTED:
            s_mqtt_connected = false;
            ESP_LOGW(TAG, "MQTT mất kết nối — buffering ON | broker=%s:%d | buffer=%d/%d",
                     MQTT_BROKER_URI, MQTT_PORT, ring_count(), RING_BUF_SIZE);
            break;
        case MQTT_EVENT_ERROR:
            s_mqtt_connected = false;
            ESP_LOGE(TAG, "MQTT_EVENT_ERROR — chưa kết nối được broker/Raspberry Pi Gateway? broker=%s:%d | buffer=%d/%d",
                     MQTT_BROKER_URI, MQTT_PORT, ring_count(), RING_BUF_SIZE);
            break;
        case MQTT_EVENT_DATA:
            if (mqtt_topic_match(ev, TOPIC_CMD_PUMP_AUTO)) {
                handle_auto_pump_command(ev);
            } else if (mqtt_topic_match(ev, TOPIC_CMD_PUMP_DIRECT)) {
                handle_dt_pump_command(ev);
            } else if (mqtt_topic_match(ev, TOPIC_CMD_LIGHT_DIRECT)) {
                handle_dt_light_command(ev, "DIRECT_DT");
            } else if (mqtt_topic_match(ev, TOPIC_CMD_PLANTING_START)) {
                handle_planting_start_command(ev);
            }
            break;
        default: break;
    }
}

static void mqtt_init(void) {
    esp_mqtt_client_config_t cfg = {
        .broker.address.uri  = MQTT_BROKER_URI,
        .broker.address.port = MQTT_PORT,
        .session.keepalive   = MQTT_KEEPALIVE_S,
        .credentials.client_id = MQTT_CLIENT_ID,
    };
    s_mqtt = esp_mqtt_client_init(&cfg);
    esp_mqtt_client_register_event(s_mqtt, ESP_EVENT_ANY_ID, mqtt_event_handler, NULL);
    esp_mqtt_client_start(s_mqtt);
}

/* ================================================================
   HARDWARE INIT
   ================================================================ */

static void hw_init(void) {
    ESP_ERROR_CHECK(i2cdev_init());

    memset(&s_rtc_dev, 0, sizeof(s_rtc_dev));
    if (ds3231_init_desc(&s_rtc_dev, I2C_MASTER_PORT,
                         I2C_MASTER_SDA, I2C_MASTER_SCL) != ESP_OK) {
        ESP_LOGE(TAG, "Lỗi: DS3231 init thất bại");
    } else {
        rtc_sync_compile_time();
    }

    gpio_config_t relay_cfg = {
        .pin_bit_mask = (1ULL << RELAY_PUMP_GPIO) | (1ULL << RELAY_LIGHT_GPIO),
        .mode         = GPIO_MODE_OUTPUT,
        .pull_down_en = GPIO_PULLDOWN_ENABLE,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&relay_cfg);
    gpio_set_level(RELAY_PUMP_GPIO,  0);
    gpio_set_level(RELAY_LIGHT_GPIO, 0);

    if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        g_sensor.phase = DEFAULT_PHASE;
        g_sensor.days_after_planting = 0.0f;
        strlcpy(g_sensor.phase_source, "BOOT_DEFAULT", sizeof(g_sensor.phase_source));
        strlcpy(g_sensor.pump_mode, "AI_AUTO", sizeof(g_sensor.pump_mode));
        strlcpy(g_sensor.pump_reason, "BOOT_OFF", sizeof(g_sensor.pump_reason));
        strlcpy(g_sensor.light_mode, "AUTO_RTC", sizeof(g_sensor.light_mode));
        strlcpy(g_sensor.light_reason, "PHASE1_LOW_LIGHT", sizeof(g_sensor.light_reason));
        xSemaphoreGive(s_sensor_mutex);
    }

    ESP_LOGI(TAG, "HW init xong | relay pump=GPIO%d OFF | relay light=GPIO%d OFF | default phase=%d(%s)",
             RELAY_PUMP_GPIO, RELAY_LIGHT_GPIO, DEFAULT_PHASE, phase_to_text(DEFAULT_PHASE));
}

/* ================================================================
   TASKS CỐT LÕI
   ================================================================ */

/**
 * @brief Task: Đọc tuần hoàn dữ liệu từ toàn bộ mảng cảm biến.
 */
static void sensor_task(void *pv) {
    ESP_LOGI(TAG, "sensor_task running on core %d", xPortGetCoreID());
    dht11_t dht = { .dht11_pin = DHT11_GPIO };
    i2c_dev_t bh_dev = {0};
    bool bh_ready = false, ads_ready = false;

    if (i2c_take(1500)) {
        if (bh1750_init_desc(&bh_dev, BH1750_I2C_ADDR, I2C_MASTER_PORT, I2C_MASTER_SDA, I2C_MASTER_SCL) == ESP_OK
            && bh1750_power_on(&bh_dev) == ESP_OK
            && bh1750_setup(&bh_dev, BH1750_MODE_CONTINUOUS, BH1750_RES_HIGH2) == ESP_OK) {
            bh_ready = true;
        } else {
            ESP_LOGW(TAG, "BH1750 init/setup chưa sẵn sàng");
        }
        i2c_give();
    } else {
        ESP_LOGW(TAG, "BH1750 init skip: I2C busy");
    }

    if (i2c_take(1500)) {
        if (ads111x_init_desc(&s_ads_dev, ADS1115_I2C_ADDR, I2C_MASTER_PORT, I2C_MASTER_SDA, I2C_MASTER_SCL) == ESP_OK
            && ads111x_set_mode(&s_ads_dev, ADS111X_MODE_SINGLE_SHOT) == ESP_OK
            && ads111x_set_data_rate(&s_ads_dev, ADS111X_DATA_RATE_128) == ESP_OK
            && ads111x_set_gain(&s_ads_dev, ADS111X_GAIN_4V096) == ESP_OK) {
            ads_ready = true;
        } else {
            ESP_LOGW(TAG, "ADS1115 init/setup chưa sẵn sàng");
        }
        i2c_give();
    } else {
        ESP_LOGW(TAG, "ADS1115 init skip: I2C busy");
    }

    vTaskDelay(pdMS_TO_TICKS(2000));

    while (1) {
        sensor_data_t snap = {0};
        snap.uptime_s = (long)(esp_timer_get_time() / 1000000LL);
        rtc_get_iso(snap.iso_time, sizeof(snap.iso_time));
        snap.rtc_ok = (snap.iso_time[0] == '2');

