lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
        if (dht11_read(&dht, 3) == 0) {
            float ft, fh;
            dht11_moving_avg(dht.temperature, dht.humidity, &ft, &fh);
            snap.temperature = ft; snap.air_humidity = fh; snap.dht11_ok = true;
        } else {
            if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                snap.temperature = g_sensor.temperature; snap.air_humidity = g_sensor.air_humidity;
                xSemaphoreGive(s_sensor_mutex);
            }
        }

        if (bh_ready) {
            uint16_t raw = 0;
            if (i2c_take(600)) {
                if (bh1750_read(&bh_dev, &raw) == ESP_OK) {
                    snap.lux = (float)raw / 2.0f;
                    snap.bh1750_ok = true;
                }
                i2c_give();
            }
        }

        if (ads_ready) {
            bool all_ok = true;
            if (i2c_take(3000)) {
                for (int i = 0; i < SOIL_CH_COUNT; i++) {
                    float voltage = 0.0f;
                    if (ads_read_channel_median_voltage(SOIL_MUX[i], &voltage)) {
                        snap.soil_voltage[i] = voltage;
                        snap.soil_pct[i] = ads_voltage_to_pct(voltage);
                    } else {
                        all_ok = false;
                    }
                }
                i2c_give();
            } else {
                all_ok = false;
                ESP_LOGW(TAG, "ADS1115 skip: I2C busy");
            }
            snap.ads1115_ok = all_ok;
        }

        apply_sensor_filter_and_fusion(&snap);

        wifi_ap_record_t ap;
        if (esp_wifi_sta_get_ap_info(&ap) == ESP_OK) snap.wifi_rssi = ap.rssi;

        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            snap.pump_state = g_sensor.pump_state;
            strlcpy(snap.pump_mode,
                    g_sensor.pump_mode[0] ? g_sensor.pump_mode : "AI_AUTO",
                    sizeof(snap.pump_mode));
            strlcpy(snap.pump_reason,
                    g_sensor.pump_reason[0] ? g_sensor.pump_reason : "UNKNOWN",
                    sizeof(snap.pump_reason));
            snap.light_state = g_sensor.light_state;
            snap.phase       = g_sensor.phase ? g_sensor.phase : DEFAULT_PHASE;
            snap.days_after_planting = g_sensor.days_after_planting;
            strlcpy(snap.phase_source,
                    g_sensor.phase_source[0] ? g_sensor.phase_source : "UNKNOWN",
                    sizeof(snap.phase_source));
            strlcpy(snap.light_mode,
                    g_sensor.light_mode[0] ? g_sensor.light_mode : "AUTO_RTC",
                    sizeof(snap.light_mode));
            strlcpy(snap.light_reason,
                    g_sensor.light_reason[0] ? g_sensor.light_reason : "UNKNOWN",
                    sizeof(snap.light_reason));
            g_sensor = snap;
            xSemaphoreGive(s_sensor_mutex);
        }

        static int sensor_log_tick = 0;
        sensor_log_tick++;
        if ((sensor_log_tick % SENSOR_LOG_EVERY_N) == 0) {
            log_sensor_snapshot(&snap, s_step, ring_count());
        }

        vTaskDelay(pdMS_TO_TICKS(SENSOR_READ_MS));
    }
}

/**
 * @brief Task: ESP32 là nguồn phase chính.
 *
 * Luồng hiện tại:
 * - ESP32 đọc DS3231 RTC và tính days_after_planting từ planting_start_epoch lưu trong NVS. 
 * - Nếu days_after_planting < DARK_PHASE_DAYS => Phase 1.
 * - Nếu days_after_planting >= DARK_PHASE_DAYS => Phase 2.
 * - ESP32 tự bật/tắt đèn theo phase và lịch RTC.
 * - Gateway chỉ nhận phase trong JSON để chạy AI/ghi log, không gửi cmd/phase liên tục.
 */
static void light_schedule_task(void *pv) {
    ESP_LOGI(TAG, "light_schedule_task running on core %d", xPortGetCoreID());
    bool last_light_on = false;
    int  last_phase = -1;
    char last_reason[24] = {0};
    int heartbeat_tick = 0;

    while (1) {
        int phase = s_current_phase;
        float days_after_planting = -1.0f;
        char phase_source[24] = {0};
        bool rtc_phase_ok = rtc_get_phase_from_planting_time(&phase,
                                                             &days_after_planting,
                                                             phase_source,
                                                             sizeof(phase_source));
        s_current_phase = phase;

        int hour_utc7 = -1;
        bool rtc_hour_ok = rtc_get_hour_utc7(&hour_utc7);
        bool rtc_ok = rtc_phase_ok && rtc_hour_ok;

        /* Nếu Digital Twin đang điều khiển đèn trực tiếp thì không cho AUTO_RTC ghi đè. */
        if (light_direct_active()) {
            if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                g_sensor.phase = phase;
                g_sensor.days_after_planting = days_after_planting;
                strlcpy(g_sensor.phase_source, phase_source, sizeof(g_sensor.phase_source));
                g_sensor.rtc_ok = rtc_ok;
                xSemaphoreGive(s_sensor_mutex);
            }
            if (++heartbeat_tick >= (LIGHT_LOG_HEARTBEAT_S * 1000 / LIGHT_CTRL_MS)) {
                ESP_LOGW(TAG, "LIGHT AUTO_RTC paused: DIRECT_DT active, phase=%d days=%.2f",
                         phase, days_after_planting);
                heartbeat_tick = 0;
            }
            vTaskDelay(pdMS_TO_TICKS(LIGHT_CTRL_MS));
            continue;
        }

        if (s_light_direct_until_us > 0 && !light_direct_active()) {
            s_light_direct_until_us = 0;
            ESP_LOGI(TAG, "LIGHT DIRECT expired -> return AUTO_RTC");
        }

        bool light_on = false;
        const char *reason = "RTC_ERROR";

        if (rtc_hour_ok) {
            light_on = light_should_be_on_by_schedule(phase, hour_utc7);
            reason = (phase == PHASE_1_DARK) ? "PHASE1_LOW_LIGHT" :
                     (light_on ? "PHASE2_DAYLIGHT_SIM" : "PHASE2_NIGHT_SIM");
        }

        gpio_set_level(RELAY_LIGHT_GPIO, light_on ? 1 : 0);

        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            g_sensor.phase = phase;
            g_sensor.days_after_planting = days_after_planting;
            strlcpy(g_sensor.phase_source, phase_source, sizeof(g_sensor.phase_source));
            g_sensor.light_state = light_on;
            g_sensor.rtc_ok = rtc_ok;
            strlcpy(g_sensor.light_mode, "AUTO_RTC", sizeof(g_sensor.light_mode));
            strlcpy(g_sensor.light_reason, reason, sizeof(g_sensor.light_reason));
            xSemaphoreGive(s_sensor_mutex);
        }

