lucas-traumen/Plant-Monitoring-CPS/esp32/esp32_v1/main/main.c
        heartbeat_tick++;
        bool changed = (phase != last_phase) ||
                       (light_on != last_light_on) ||
                       (strncmp(reason, last_reason, sizeof(last_reason)) != 0);

        if (changed || heartbeat_tick >= (LIGHT_LOG_HEARTBEAT_S * 1000 / LIGHT_CTRL_MS)) {
            ESP_LOGI(TAG, "LIGHT phase=%d(%s) source=%s days=%.2f rtc=%s hour=%d schedule=%02d-%02d => light=%s reason=%s",
                     phase, phase_to_text(phase), phase_source, days_after_planting,
                     rtc_ok ? "OK" : "ERR", hour_utc7,
                     LIGHT_ON_HOUR_UTC7, LIGHT_OFF_HOUR_UTC7,
                     light_on ? "ON" : "OFF", reason);
            last_phase = phase;
            last_light_on = light_on;
            strlcpy(last_reason, reason, sizeof(last_reason));
            heartbeat_tick = 0;
        }

        vTaskDelay(pdMS_TO_TICKS(LIGHT_CTRL_MS));
    }
}


/**
 * @brief Task: Bảo vệ actuator direct mode và publish trạng thái relay thật.
 *
 * - Nếu Digital Twin bật bơm với duration_s, ESP32 tự tắt khi hết thời gian.
 * - Publish định kỳ actuator/state để Gateway/Influx xác nhận trạng thái vật lý.
 */
static void actuator_state_task(void *pv) {
    ESP_LOGI(TAG, "actuator_state_task running on core %d", xPortGetCoreID());
    int64_t last_pub_us = 0;

    while (1) {
        int64_t now = esp_timer_get_time();

        if (s_pump_direct_until_us > 0 && now >= s_pump_direct_until_us) {
            bool was_on = false;
            if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                was_on = g_sensor.pump_state;
                xSemaphoreGive(s_sensor_mutex);
            }

            if (was_on) {
                set_pump_state(false, "AI_AUTO", "DIRECT_TIMEOUT_OFF");
                ESP_LOGW(TAG, "Pump DIRECT timeout -> OFF, return AI_AUTO");
                publish_actuator_state("PUMP_DIRECT_TIMEOUT");
            }
            s_pump_direct_until_us = 0;
        }

        if (s_light_direct_until_us > 0 && now >= s_light_direct_until_us) {
            s_light_direct_until_us = 0;
            ESP_LOGI(TAG, "Light DIRECT timeout -> AUTO_RTC will resume by schedule task");
            publish_actuator_state("LIGHT_DIRECT_TIMEOUT");
        }

        if (s_mqtt_connected && (now - last_pub_us) >= ((int64_t)ACTUATOR_STATE_PUBLISH_MS * 1000LL)) {
            publish_actuator_state("PERIODIC_STATE");
            last_pub_us = now;
        }

        vTaskDelay(pdMS_TO_TICKS(500));
    }
}

/**
 * @brief Task: Xuất dữ liệu lên MQTT và giải phóng bộ đệm (Drain Buffer).
 */
static void publish_task(void *pv) {
    ESP_LOGI(TAG, "publish_task running on core %d", xPortGetCoreID());
    static char json_buf[JSON_MAX_LEN];
    static char drain_buf[JSON_MAX_LEN];

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(MQTT_PUBLISH_MS));
        sensor_data_t snap;
        if (xSemaphoreTake(s_sensor_mutex, pdMS_TO_TICKS(200)) == pdTRUE) {
            snap = g_sensor;
            xSemaphoreGive(s_sensor_mutex);
        } else continue;

        s_step++;
        int len = build_json(json_buf, sizeof(json_buf), &snap, s_step);
        if (len <= 0) continue;

        int ring_before = ring_count();
        if (s_mqtt_connected) {
            int msg_id = esp_mqtt_client_publish(s_mqtt, TOPIC_SENSOR, json_buf, len, MQTT_QOS, 0);
            if (msg_id < 0) {
                ESP_LOGW(TAG, "Publish fail step=%d — lưu buffer", s_step);
                ring_push(json_buf);
            } else {
                ESP_LOGI(TAG, "PUBLISH step=%d msg_id=%d len=%d phase=%d soil=%.1f%% light=%s buffer=%d/%d",
                         s_step, msg_id, len, snap.phase, soil_avg_from_snapshot(&snap),
                         snap.light_state ? "ON" : "OFF", ring_before, RING_BUF_SIZE);
            }

            int drained = 0;
            while (s_mqtt_connected && ring_count() > 0 && drained < DRAIN_MAX_PER_CYCLE) {
                if (!ring_peek(drain_buf)) break;
                if (esp_mqtt_client_publish(s_mqtt, TOPIC_SENSOR, drain_buf, strlen(drain_buf), MQTT_QOS, 0) >= 0) {
                    ring_pop();
                    drained++;
                } else break;
                vTaskDelay(pdMS_TO_TICKS(200));
            }
            if (drained > 0) {
                ESP_LOGI(TAG, "DRAIN buffer: đã gửi lại %d packet, còn %d/%d",
                         drained, ring_count(), RING_BUF_SIZE);
            }
        } else {
            ring_push(json_buf);
            if ((s_step % OFFLINE_LOG_EVERY_N) == 0 || ring_count() == 1) {
                ESP_LOGW(TAG, "OFFLINE step=%d — Raspberry Pi Gateway/MQTT chưa sẵn sàng, lưu packet vào ring buffer %d/%d",
                         s_step, ring_count(), RING_BUF_SIZE);
            }
        }
    }
}

/* ================================================================
   MAIN ENTRY
   ================================================================ */

void app_main(void) {
    ESP_LOGI(TAG, "=== %s | %s v%s ===", PLANT_NAME, NODE_ID, FW_VERSION);
    ESP_LOGI(TAG, "MQTT broker=%s:%d | client_id=%s", MQTT_BROKER_URI, MQTT_PORT, MQTT_CLIENT_ID);
    ESP_LOGI(TAG, "Topics v2 | sensor=%s | esp32_status=%s | actuator_state=%s",
             TOPIC_SENSOR, TOPIC_STATUS_ESP32, TOPIC_ACTUATOR_STATE);
    ESP_LOGI(TAG, "Topics v2 | auto_pump=%s | direct_pump=%s | direct_light=%s | planting=%s",
             TOPIC_CMD_PUMP_AUTO, TOPIC_CMD_PUMP_DIRECT, TOPIC_CMD_LIGHT_DIRECT,
             TOPIC_CMD_PLANTING_START);

    esp_err_t nvs_ret = nvs_flash_init();
    if (nvs_ret == ESP_ERR_NVS_NO_FREE_PAGES || nvs_ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        nvs_flash_erase();
        nvs_flash_init();
    }

    s_sensor_mutex = xSemaphoreCreateMutex();
    s_i2c_mutex = xSemaphoreCreateMutex();
    setenv("TZ", TZ_INFO_UTC7, 1);
    tzset();
    ring_init();
    hw_init();
    wifi_init();

    /* BOOT FLOW chuẩn v2.9.3:
     * 1) Nếu WiFi có IP thì check NTP và cập nhật DS3231 nếu lệch.
     * 2) Load planting_start_epoch từ NVS nếu có.
     * 3) Nếu NVS rỗng: valid=false, KHÔNG tự tạo mốc mới. Gateway sẽ sync từ DB/Unity.
     * 4) Task NTP sau đó chỉ sync DS3231 định kỳ, KHÔNG ghi lại mốc gieo.
     */
    EventBits_t boot_wifi_bits = xEventGroupGetBits(s_wifi_eg);
    if (boot_wifi_bits & WIFI_CONNECTED_BIT) {
        ntp_start_once();
        if (ntp_wait_time_valid(NTP_SYNC_TIMEOUT_MS)) {
            rtc_sync_from_ntp_if_needed();
        }
    } else {
        ESP_LOGW(TAG, "BOOT: chưa có WiFi, bỏ qua NTP ban đầu; dùng DS3231 hiện có để xét planting_start");
    }
    planting_start_init_from_nvs_or_rtc();

    mqtt_init();

    /* Core pinning:
     * CORE_NET: MQTT publish + NTP
     * CORE_APP: Sensor + RTC phase/light + actuator safety
     */
    xTaskCreatePinnedToCore(ntp_rtc_sync_task,   "ntp_rtc", 4096, NULL, 3, NULL, CORE_NET);
    xTaskCreatePinnedToCore(publish_task,        "publish",  4096, NULL, 3, NULL, CORE_NET);

    xTaskCreatePinnedToCore(sensor_task,         "sensor",   4096, NULL, 5, NULL, CORE_APP);
    xTaskCreatePinnedToCore(light_schedule_task, "light",    3072, NULL, 4, NULL, CORE_APP);
    xTaskCreatePinnedToCore(actuator_state_task, "act_state",4096, NULL, 4, NULL, CORE_APP);

    ESP_LOGI(TAG, "Tất cả tasks đã khởi động (RTC phase owner + Multi-WiFi + DT direct actuator)");
}
